app/views/combis/index.html.erb

SELECT "combis".* FROM "combis"
---
  <div class="combis">
    <% Combi.all.each do |combi| %>