app/views/annonces/_form.html.erb

      <%= form.label :combi %>
      <%= collection_select(:annonce, :combi_id, Combi.all, :id, :combi_infos) %>
---
SELECT "combis".* FROM "combis"