app/views/annonces/index.html.erb

        <td><%= annonce.description %></td>
        <td><%= User.find(annonce.creator_id).username %></td>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]