app/controllers/activites_controller.rb

SELECT "activites".* FROM "activites"
---
  def index
    @activites = Activite.all

SELECT  "activites".* FROM "activites" WHERE "activites"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @activite = Activite.find(params[:id])

INSERT INTO "activites" ("titre", "description", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["titre", "Kayak"], ["description", "On va faire du kayak oyé oyé "], ["location", "Paris"], ["created_at", "2017-12-07 13:49:14.607497"], ["updated_at", "2017-12-07 13:49:14.607497"]]
---
  def create
    @activite = Activite.new(activite_params)
    # link the current user to the combi it create
    @activite[:user_id] = current_user[:id]


    respond_to do |format|
      if @activite.save