app/controllers/annonces_controller.rb

SELECT "annonces".* FROM "annonces"
---
  def index
    @annonces = Annonce.all

INSERT INTO "annonces" ("title", "description", "status", "creator_id", "location", "start", "end", "combi_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @annonce = Annonce.new(annonce_params)
    # link the current user to the combi it create
    @annonce[:creator_id] = current_user[:id]

    respond_to do |format|
      if @annonce.save

SELECT  "annonces".* FROM "annonces" WHERE "annonces"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_annonce
      @annonce = Annonce.find(params[:id])