app/controllers/combis_controller.rb

SELECT "combis".* FROM "combis"
---
  def index
    @combis = Combi.all

INSERT INTO "combis" ("marque", "year", "owner", "kilometers", "fueltype", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @combi = Combi.new(combi_params)
    # link the current user to the combi it create
    @combi[:user_id] = current_user[:id]

    respond_to do |format|
      if @combi.save

DELETE FROM "combis" WHERE "combis"."id" = ?  [["id", 1]]
---
  def destroy
    @combi.destroy

SELECT  "combis".* FROM "combis" WHERE "combis"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_combi
      @combi = Combi.find(params[:id])